{
    "ENHANCED REANIMATION PROTOCOLS": {
        "description": "The Necrons are a deathless foe that can recover from obliteration time and again.",
        "stratagem": "Use this Stratagem before making Reanimation Protocols rolls for a unit from your army. You can re-roll Reanimation Protocols rolls of 1 for that unit this turn.",
        "cost": 2,
        "conditions": [
            "abilities"
        ],
        "abilities": [
            "Reanimation Protocol"
        ]
    },
    "WRATH OF THE C’TAN": {
        "description": "The C’tan’s ever-burning rage at their enslavement is turned upon the enemy with cataclysmic results.",
        "stratagem": "Use this Stratagem after a C’TAN SHARD from your army has resolved a Power of the C’tan. Roll a D6 to randomly select a Power of the C’tan from page 113. The C’tan Shard immediately uses the power rolled, even if it has already used that power this phase.",
        "cost": 2,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "C'tan Shards"
        ]
    },
    "EMERGENCY INVASION BEAM": {
        "description": "Before it is destroyed, the Necron construct shifts all power to its dimensional gateway, beaming in warriors to take its place.",
        "stratagem": "Use this Stratagem when the last <DYNASTY> Night Scythe and/or Monolith from your army is destroyed. Before removing the model from the battlefield, you can immediately set up a friendly <DYNASTY> unit still on their tomb world wholly within 3\" of the Night Scythe/Monolith and more than 1\" from any enemy models.",
        "cost": 1,
        "conditions": [
            "keywords",
            "any"
        ],
        "keywords": [
            "Night Scythe",
            "Monolith"
        ]
    },
    "AMALGAMATED TARGETING DATA": {
        "description": "Synchronised targeting optics are fed to the Doom Scythe squadron, and they release a devastating pinpoint barrage.",
        "stratagem": "Use this Stratagem in your Shooting phase if a <DYNASTY> Doom Scythe from your army is within 6\" of 2 other friendly <DYNASTY> Doom Scythes. The Doom Scythes cannot fire their death rays this phase – instead, select a point on the battlefield within 24\" of all three vehicles that is visible to all of them. Roll a D6 for each unit within 3\" of that point. Add 1 to the result if the unit being rolled for has 5 or more models, but subtract 1 if the unit being rolled for is a CHARACTER. On a 4+, that unit suffers 3D3 mortal wounds.",
        "cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Doom Scythe"
        ]
    },
    "DYNASTIC HEIRLOOMS": {
        "description": "In times of need, the phaerons will order the relic-vaults emptied, their priceless contents distributed amongst the legions.",
        "stratagem": "Use this Stratagem before the battle. Your army can have one extra Artefact of the Aeons for 1 CP, or two extra Artefacts of the Aeons for 3 CPs. All of the Artefacts of the Aeons that you include must be different and be given to different NECRONS CHARACTERS. This Stratagem can only be used once per battle.",
        "cost": 3,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Character"
        ]
    },
    "ENHANCED INVASION BEAM": {
        "description": "A shimmering dimensional portal yawns wide for a few moments, spilling yet more fleshless warriors into the fray.",
        "stratagem": "Use this Stratagem before you set up a unit from a tomb world using the Invasion Beams ability of a Night Scythe from your army, or the Eternity Gate ability of a Monolith from your army. You can set up two units from a tomb world instead of one.",
        "cost": 1,
        "conditions": [
            "keywords",
            "any"
        ],
        "keywords": [
            "Night Scythe",
            "Monolith"
        ]
    },
    "SOLAR PULSE": {
        "description": "Many Necron weapons contain pulsing orbs within which is bound the awesome power of a solar flare.",
        "stratagem": "Use this Stratagem after a NECRONS unit from your army has declared its targets in the Shooting phase, but before any hit rolls are made. Pick one of the enemy units that your unit is targeting. The enemy unit does not receive the benefit of cover against your unit’s weapons this phase.",
        "cost": 1,
        "conditions": [
        ]
    },
    "RESURRECTION PROTOCOLS": {
        "description": "Necron rulers possess sophisticated self-repair systems that can knit together even the most grievous wounds.",
        "stratagem": "Use this Stratagem when a NECRONS CHARACTER from your army (excluding Trazyn the Infinite and C’TAN SHARDS) is slain. At the end of that phase, roll a D6. On a 4+ set the character up again, as close as possible to his previous position, and more than 1\" from any enemy models, with 1 wound remaining. This Stratagem cannot be used to resurrect the same model more than once per battle.",
        "cost": 1,
        "conditions": [
            "keywords",
            "excludes"
        ],
        "keywords": [
            "Character"
        ],
        "excludes": {
            "keywords": [
                "Trazyn the Infinite"
            ],
            "factionkeywords": [
                "C'tan Shards"
            ]
        }
    },
    "DAMAGE CONTROL OVERRIDE": {
        "description": "Its self-repair routines overridden, the vehicle briefly operates at peak efficiency despite being critically damaged.",
        "stratagem": "Use this Stratagem at the start of any turn. Pick a NECRONS VEHICLE from your army. Until the end of this turn, use the top row of that vehicle’s damage table, regardless of how many wounds it has left. This ends immediately if the model is reduced to 0 wounds.",
        "cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Vehicle"
        ]
    },
    "REPAIR SUBROUTINES": {
        "description": "When engaged in a battle of attrition, Canoptek constructs react by enabling a series of repairing adaptive subroutines.",
        "stratagem": "Use this Stratagem at the start of your turn, before making any Reanimation Protocols rolls. Select a CANOPTEK unit from your army that is on the battlefield. That unit gains the Reanimation Protocols ability until the end of your turn."
        ,"cost": 2,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Canoptek"
        ]
    },
    "SELF-DESTRUCTION": {
        "description": "The self-destruct protocols of Canoptek Scarabs cause them to explode in a hail of razor-sharp armour fragments.",
        "stratagem": "Use this Stratagem after a unit of Canoptek Scarabs from your army piles in, but before they make their close combat attacks. Select a Canoptek Scarab Swarm model in your unit and then pick an enemy unit within 1\" of it. Your Canoptek Scarab Swarm model is destroyed. Remove it from the battlefield and roll a D6; on a 2+ the enemy unit you picked suffers D3 mortal wounds."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Canoptek Scarabs"
        ]
    },
    "DISRUPTION FIELDS": {
        "description": "The thrumming aura of negative energy known as a disruption field warps and dissolves both armour and flesh.",
        "stratagem": "Use this Stratagem before a NECRONS INFANTRY unit from your army fights in the Fight phase. Increase the Strength characteristic of all models in that unit by 1 until the end of the phase."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Infantry"
        ]
    },
    "ENTROPIC STRIKE": {
        "description": "The disruption field emanating from this warrior’s weapon is so powerful that it entirely obliterates matter from existence.",
        "stratagem": "Use this Stratagem in the Fight phase before a NECRONS CHARACTER from your army fights. Invulnerable saves cannot be taken against the first close combat attack made by this character this phase."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Character"
        ]
    },
    "DISPERSION FIELD AMPLIFICATION": {
        "description": "Lychguard can overcharge the fields of their dispersion shields.",
        "stratagem": "Use this Stratagem in the Shooting phase when an enemy unit targets a unit of Lychguard from your army equipped with dispersion shields. Your unit’s invulnerable save is improved to 3+ until the end of the phase. In addition, until the end of the phase, each time you roll an unmodified 6 for this unit’s invulnerable saving throw, the unit that made that attack suffers a mortal wound after it has finished making all of its shooting attacks."
        ,"cost": 2,
        "conditions": [
            "wargear",
            "keywords"
        ],
        "wargear": [
            "Dispersion Shield"
        ],
        "keywords": [
            "Lychguard"
        ]
    },
    "QUANTUM DEFLECTION": {
        "description": "Necron quantum shielding is a true marvel of techno-arcana, phasing into existence only at the moment of impact.",
        "stratagem": "Use this Stratagem when an enemy unit targets a VEHICLE in your army that has the Quantum Shielding ability, but before any hit rolls are made. Until the end of the phase, subtract 1 from rolls made for your vehicle’s Quantum Shielding ability to see if damage is ignored for each unsaved wound."
        ,"cost": 1,
        "conditions": [
            "abilities",
            "keywords"
        ],
        "abilities": [
            "Quantum Shielding"
        ],
        "keywords": [
            "Vehicle"
        ]
    },
    "EXTERMINATION PROTOCOLS": {
        "description": "Destroyers have sacrificed every last ember of their souls in order to pursue the obliteration of all mortal life.",
        "stratagem": "Use this Stratagem in your Shooting phase before shooting with a Destroyer Lord, a unit of Destroyers or a unit of Heavy Destroyers from your army. Re-roll failed hit and wound rolls for that unit until the end of the phase."
        ,"cost": 1,
        "conditions": [
            "keywords",
            "any"
        ],
        "keywords": [
            "Destroyer Lord",
            "Destroyers",
            "Heavy Destroyers"
        ]
    },
    "THE PHAERON’S WILL": {
        "description": "The generals of the Necron Empire are peerless strategists who have overseen the obliteration of countless civilisations.",
        "stratagem": "Use this Stratagem after an OVERLORD from your army has used their My Will Be Done or Wave of Command ability. That model can immediately use that ability for a second time this turn."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Overlord"
        ]
    },
    "ADAPTIVE SUBROUTINES": {
        "description": "The Crypteks have invested their mechanical constructs with complex hunter-killer algorithms.",
        "stratagem": "Use this Stratagem after a CANOPTEK unit from your army has Advanced. That unit can still shoot and/or charge this turn."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Canoptek"
        ]
    },
    "DIMENSIONAL CORRIDOR": {
        "description": "Necron Monoliths can redirect a tomb world’s forces by projecting a series of short-ranged dimensional portals.",
        "stratagem": "Use this Stratagem at the start of your Movement phase. Select a <DYNASTY> INFANTRY unit from your army that is more than 1\" from any enemy models and remove it from the battlefield. Then, set the unit up again so that it is wholly within 3\" of a <DYNASTY> Monolith from your army and more than 1\" from any enemy models. That unit counts as having disembarked from the Monolith this turn and can move normally."
        ,"cost": 1,
        "conditions": [
            "keywords",
            "all"
        ],
        "keywords": [
            "Infantry",
            "Monolith"
        ]
    },
    "JUDGEMENT OF THE TRIARCH": {
        "description": "Those who defy the will of the Triarch are subject to swift and merciless retribution.",
        "stratagem": "Use this Stratagem before a unit of Triarch Praetorians from your army shoots in the Shooting phase or fights in the Fight phase. Add 1 to hit rolls made for this unit until the end of the phase."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Triarch Praetorians"
        ]
    },
    "GRAVITIC SINGULARITY": {
        "description": "A pulsing gravitic anomaly appears in the sky over the Obelisk, dragging enemy aircraft into its crushing embrace.",
        "stratagem": "Use this Stratagem at the start of your Shooting phase. Select an Obelisk from your army. When resolving this model’s Gravity Pulse ability this phase, each enemy unit within range that can FLY suffers D3 mortal wounds on a roll of 4+, instead of a roll of 6."
        ,"cost": 1,
        "conditions": [
            "keywords"
        ],
        "keywords": [
            "Obelisk"
        ]
    },
    "COSMIC POWERS": {
        "description": "The powers of the C’tan are myriad and terrifying. To battle a fragment of these shackled star gods is to find reality unbound.",
        "stratagem": "Use this Stratagem at the start of your Movement phase. Select a C’TAN SHARD from your army. That model can replace one of its Powers of the C’tan with a different Power of the C’tan of your choice."
        ,"cost": 1,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "C'tan Shards"
        ]
    },
    "METHODICAL DESTRUCTION": {
        "description": "The Sautekh Dynasty excel in systematic killing, marking each target until it is completely obliterated.",
        "stratagem": "Use this Stratagem after a SAUTEKH unit from your army has inflicted an unsaved wound on an enemy unit. Add 1 to hit rolls for friendly SAUTEKH units that target the same enemy unit this phase."
        ,"cost": 2,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "Sautekh"
        ]
    },
    "RECLAIM A LOST EMPIRE": {
        "description": "The Nihilakh seek to rule the galaxy, and once they have claimed a domain it is almost impossible to drive them from it.",
        "stratagem": "Use this Stratagem at the end of your turn. Select a NIHILAKH unit from your army. If the unit is within 3\" of an objective marker, or if it did not move for any reason during its turn, then until the start of your next turn you can add 1 to saving throws made for that unit and increase the Attacks characteristic of models in that unit by 1."
        ,"cost": 2,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "Nihilakh"
        ]
    },
    "TRANSLOCATION CRYPT": {
        "description": "Masters of teleportation technology, the Nephrekh ride into battle upon blinding beams of light.",
        "stratagem": "Use this Stratagem during deployment. You can set up a NEPHREKH INFANTRY or SWARM unit from your army in a translocation crypt instead of placing it on the battlefield. At the end of any of your Movement phases this unit can translocate into battle – set it up anywhere on the battlefield that is more than 9\" away from any enemy models."
        ,"cost": 1,
        "conditions": [
            "factionkeywords",
            "keywords",
            "any"
        ],
        "factionkeywords": [
            "Nephrekh"
        ],
        "keywords": [
            "Infantry",
            "Swarm"
        ]
    },
    "BLOOD RITES": {
        "description": "Novokh’s warriors have mastered the arts of martial warfare, and their deathless bodies allow them to fight on tirelessly.",
        "stratagem": "Use this Stratagem at the end of the Fight phase. Select a NOVOKH unit from your army – that unit can immediately fight for a second time."
        ,"cost": 3,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "Novokh"
        ]
    },
    "TALENT FOR ANNIHILATION": {
        "description": "The Mephrit seek not merely to defeat their foes, but to entirely expunge them from the face of the galaxy.",
        "stratagem": "Use this Stratagem before a MEPHRIT unit from your army attacks in the Shooting phase. Each time you make an unmodified hit roll of 6 for a model in that unit, you can make one additional hit roll for that model with the same weapon against the same target. These additional hit rolls cannot themselves generate any further hit rolls."
        ,"cost": 1,
        "conditions": [
            "factionkeywords"
        ],
        "factionkeywords": [
            "Mephrit"
        ]
    }
}